const pages = {
  1:{
type: "video", 
    src: "videos/1.mp4",
    text: ""
  },
  2:{
type: "video", 
    src: "videos/2.mp4",
    poster: "poster1.jpg",
    text: "黑魔王的阴影已吞噬一切\n1970年代的巫师界沉沦于血色恐怖。\n伏地魔的势力撕裂了秩序的帷幕，食死徒在夜色中狩猎麻瓜出身者，《预言家日报》的讣告栏比魁地奇比分更令人窒息。\n魔法部在渗透下沦为虚壳，尖叫与失踪成为日常——这是最黑暗的时代。"
  },
  3: {
    type: "video",
    src: "videos/3.mp4",
    poster: "poster2.jpg",
    text: "城堡内的冰冷战场\n霍格沃茨，千年庇护所，如今沦为光暗交锋的前线。\n斯莱特林学院滑向深渊，纯血徽章在绿银袍服间灼灼闪烁，走廊回荡着“泥巴种”的恶毒讥笑。麻瓜出身者如莉莉·伊万斯，在书本被毁、倒吊取乐的屈辱中挣扎。\n学院对立化作仇恨的刀锋，而刀柄，正被一双双未来食死徒的手紧握。"
  },
  4: {
    type: "video",
    src: "videos/4.mp4",
    text: "唯一的火种唯有阿不思·邓布利多矗立于风暴中心。校长室的灯火是最后的灯塔，凤凰社在阴影中编织抵抗之网。但黑魔法的毒蔓已爬上城堡石墙，平静的课堂下暗涌着战争的预演。"
  },

  5: {
    type: "image",
    src: "images/外景.png",
    text: "你将何为？扮演詹姆·波特，“掠夺者”的领袖。以天才的魔咒掌控力与叛逆的热血，在这座濒临破碎的城堡中："
  },
  6: {
    type: "image",
    src: "images/外景.png",
    text: "挥动魔杖：对抗斯莱特林霸凌者的恶咒，在决斗俱乐部、午夜走廊甚至禁林中为正义而战\n凝聚光明：与挚友小天狼星、卢平、彼得结成阴影中的防线，用活点地图刺破阴谋\n抉择前路：你的每一次选择，都将重塑掠夺者的传奇"
  },
  7: {
    type: "image",
    src: "images/外景.png",
    text: "无畏前路：\n当反抗的烈火燃尽校园的枷锁，凤凰社的橄榄枝悄然降临。\n加入邓布利多的秘密战争，将“掠夺者”的智谋与勇气，化为刺向黑暗王座的长矛。"
  },
  8: {
        type: "image",
        src: "images/外景.png",
        text: "情感终局：\n守护莉莉的信念，让你化身霍格沃茨的第一道防线。\n组建初代邓布利多军，以爱为盾对抗卢修斯的权谋与斯内普的恨意。\n在每一次并肩抗争中，见证百合于战火中盛放。"
    },
  9: {
        type: "image",
        src: "images/外景.png",
        text: "记住：\n你的每一次挥杖、每一个选择，都将重塑掠夺者的传奇——是成为阴影中的利刃，还是荆棘丛中的护花人？\n霍格沃茨的命运，等待你的心跳声落下重音。"
    },
  10: {
        type: "image",
        src: "images/外景.png",
        text: ""
    },
//   10: {
//         type: "image",
//         src: "images/photo1.jpg",
//         text: ""
//     },
//   11: {
//         type: "image",
//         src: "images/photo1.jpg",
//         text: ""
//     },  
}





//   1: {
//     type: "video", // video 或 image
//     src: "videos/1.mp4",
//     poster: "poster1.jpg",
//     text: "欢迎来到《星际余烬》——一款融合策略与动作的独立单机游戏。\n在这里，你要带领最后的探险舰队穿越废墟星域，重建文明的希望。"
//   },
//   2: {
//     type: "image",
//     src: "images/photo1.jpg",
//     // music: "musics/1.mp3",
//     te